Dlubal.DynamPro.IDynamModule
Interface for working with Dynam module.

Dlubal.DynamPro.IDynamModule.GetData
Get input data interface , if module data do not exist this will create them.
Returns: input data interface

Dlubal.DynamPro.IDynamModule.DeleteData
Completely deletes module data

Dlubal.DynamPro.IDynamModule.Calculate
General calculation
Returns: List of errors that occurred during the calculation

Dlubal.DynamPro.IDynamModule.CalculateNVC(System.Int32)
Calculate selected NVC
Returns: List of errors that occurred during the calculation

Dlubal.DynamPro.IDynamModule.CalculateDLC(System.Int32)
Calculate selected DLC
Returns: List of errors that occurred during the calculation

Dlubal.DynamPro.IDynamModule.GetResults
Get result interface.
Returns: input data interface